tutorials/compressible/rhoPisoFoam/ras/pipe/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets
(
    leftPatch
    {

        type            uniform;
        axis            y;
        start           (0.49 0 0.0);
        end             (0.49 0.01 0);
        nPoints         100;
    }
);

fields
(
    U p T
);

surfaces
(
);

// ************************************************************************* //
